In [1]:
import pandas as pd

In [2]:
data = [(1,2,3,4),
        (5,6,7,8),
        (9,10,11,12),
        (13,14,15,16)]

df=pd.DataFrame (data, 'L1 L2 L3 L4'.split(), 'C1 C2 C3 C4'.split())

In [3]:
df

    C1  C2  C3  C4
L1   1   2   3   4
L2   5   6   7   8
L3   9  10  11  12
L4  13  14  15  16

In [4]:
df [['C1', 'C3']]

    C1  C3
L1   1   3
L2   5   7
L3   9  11
L4  13  15

In [5]:
df[1:]

    C1  C2  C3  C4
L2   5   6   7   8
L3   9  10  11  12
L4  13  14  15  16

In [6]:
df[1:3]

    C1  C2  C3  C4
L2   5   6   7   8
L3   9  10  11  12

In [7]:
df[1:][['C3', 'C1']]

    C3  C1
L2   7   5
L3  11   9
L4  15  13

In [8]:
df.loc['L3']

C1     9
C2    10
C3    11
C4    12
Name: L3, dtype: int64

In [9]:
df

    C1  C2  C3  C4
L1   1   2   3   4
L2   5   6   7   8
L3   9  10  11  12
L4  13  14  15  16

In [10]:
df.loc[['L3', 'L2']]

    C1  C2  C3  C4
L3   9  10  11  12
L2   5   6   7   8

In [11]:
df.loc['L3', 'C2']

10

In [12]:
df.loc['L3', 'C1']

9

In [13]:
df.iloc[0, 1]

2

In [14]:
df.loc[['L3', 'L1'],['C4','C1']]

    C4  C1
L3  12   9
L1   4   1

In [15]:
df.iloc[[2,0],[3,0]]

    C4  C1
L3  12   9
L1   4   1

In [16]:
data = [['Ary', 'M', '21'],
        ['catia', 'F', '19'],
        ['carlos', 'M', '50'],
        ['beto', 'M', '29'],
        ['bruna', 'F', '31'],
        ['ana', 'F', '42']]

In [17]:
df_a = pd.DataFrame(data)

In [18]:
df_a = pd.DataFrame(data, columns = ['nome', 'sexo', 'idade'])

In [19]:
df_a

     nome sexo idade
0     Ary    M    21
1   catia    F    19
2  carlos    M    50
3    beto    M    29
4   bruna    F    31
5     ana    F    42

In [20]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [21]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [22]:
selecao = alunos['Aprovado'] == False
reprovados = alunos.loc[selecao, ['Nome', 'Sexo','Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

selecao = alunos['Aprovado'] == False
reprovados = alunos[['Nome', 'Sexo', 'Idade']][selecao]
reprovados

In [29]:
alunos.sort_values(by = ['Idade'], inplace = True )
alunos.iloc [:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True